Tekla Open API Reference for Tekla Structures 2025
Symbol Constructor
Overload List
Name | Description
Symbol(ViewBase, Point)
 Creates a new symbol instance using the default symbol information and standard attributes.
Symbol(ViewBase, Point, PlacingBase)
 Creates a new symbol instance using the default symbol information, standard attributes and the given placing.
Symbol(ViewBase, Point, SymbolInfo)
 Creates a new symbol instance using standard attributes.
Symbol(ViewBase, Point, SymbolInfo, PlacingBase)
 Creates a new symbol instance using standard attributes.
Symbol(ViewBase, Point, SymbolInfo, Symbol.SymbolAttributes)
 Creates a new symbol instance using the given attributes.
Symbol(ViewBase, Point, SymbolInfo, Symbol.SymbolAttributes, PlacingBase)
 Creates a new symbol instance using the given attributes and placing.
Top
See Also
Reference
Symbol Class
Tekla.Structures.Drawing Namespace